In [60]:
import numpy
import sqlalchemy as db
import pandas as pd

In [47]:
## USE TESTING LOCAL CONTAINER FOR AQUA DB BEFORE TRYING IN PRODUCTION
#   AQUA_DB="postgresql://dbuser:dbpassword@db/dbname"

aqua_conn = "postgresql://dbuser:dbpassword@localhost:5432/dbname"
neon_conn = "postgresql://jmansdorfer:"

In [62]:
# create anegine from connection string
aqua_engine = db.create_engine(aqua_conn)
neon_engine = db.create_engine(neon_conn)

In [49]:
source_query = f"SELECT * FROM assessment where id = 3863"
assessment = pd.read_sql_query(source_query, neon_engine)
assessment

,id,revision,reference,type,status,requested_time,start_time,end_time
0,3863,138,772,word-alignment,finished,2023-08-18 22:21:22.905083,2023-08-18 22:21:24.716605+00:00,2023-08-18 22:23:23.825737+00:00

In [72]:
assessment.rename(
    columns={"revision": "revision_id", "reference": "reference_id"}, inplace=True
)
assessment.drop(columns=["requested_time"], inplace=True)

In [73]:
assessment

,id,revision_id,reference_id,type,status,start_time,end_time
0,3863,138,772,word-alignment,finished,2023-08-18 22:21:24.716605+00:00,2023-08-18 22:23:23.825737+00:00

In [74]:
assessment.to_csv("../fixtures/assessments.txt", index=False, sep="\t")

In [63]:
source_query = f'SELECT * FROM "assessmentResult" WHERE "assessment" = 3863'
result = pd.read_sql_query(source_query, neon_engine)
result

,id,assessment,score,flag,note,vref,source,target,hide,book,chapter,verse
0,15602404,3863,0.371110,False,None,LUK 1:1,None,None,False,LUK,1,1
1,15602405,3863,0.301316,False,None,LUK 1:2,None,None,False,LUK,1,2
2,15602406,3863,0.259294,False,None,LUK 1:3,None,None,False,LUK,1,3
3,15602407,3863,0.465617,False,None,LUK 1:4,None,None,False,LUK,1,4
4,15602408,3863,0.383508,False,None,LUK 1:5,None,None,False,LUK,1,5
...,...,...,...,...,...,...,...,...,...,...,...,...
2145,15604549,3863,0.350848,False,None,ACT 28:27,None,None,False,ACT,28,27
2146,15604550,3863,0.369452,False,None,ACT 28:28,None,None,False,ACT,28,28
2147,15604551,3863,0.348152,False,None,ACT 28:29,None,None,False,ACT,28,29
2148,15604552,3863,0.446348,False,None,ACT 28:30,None,None,False,ACT,28,30
2149,15604553,3863,0.380908,False,None,ACT 28:31,None,None,False,ACT,28,31

In [64]:
# group by assessment and get number of rows
result.groupby(["assessment"]).size().reset_index(name="count")

   assessment  count
0        3863   2150

In [65]:
result.rename(columns={"assessment": "assessment_id"}, inplace=True)
result["target"] = [{} for _ in range(len(result))]
result = result.where(pd.notnull(result), None)
result

,id,assessment_id,score,flag,note,vref,source,target,hide,book,chapter,verse
0,15602404,3863,0.371110,False,None,LUK 1:1,None,{},False,LUK,1,1
1,15602405,3863,0.301316,False,None,LUK 1:2,None,{},False,LUK,1,2
2,15602406,3863,0.259294,False,None,LUK 1:3,None,{},False,LUK,1,3
3,15602407,3863,0.465617,False,None,LUK 1:4,None,{},False,LUK,1,4
4,15602408,3863,0.383508,False,None,LUK 1:5,None,{},False,LUK,1,5
...,...,...,...,...,...,...,...,...,...,...,...,...
2145,15604549,3863,0.350848,False,None,ACT 28:27,None,{},False,ACT,28,27
2146,15604550,3863,0.369452,False,None,ACT 28:28,None,{},False,ACT,28,28
2147,15604551,3863,0.348152,False,None,ACT 28:29,None,{},False,ACT,28,29
2148,15604552,3863,0.446348,False,None,ACT 28:30,None,{},False,ACT,28,30
2149,15604553,3863,0.380908,False,None,ACT 28:31,None,{},False,ACT,28,31

isoScript

In [67]:
result.to_json("../fixtures/assessment_results.json", orient="records", lines=True)

In [39]:
source_query = f'SELECT * FROM "bibleRevision" WHERE "id" in (138,772)'
revision = pd.read_sql_query(source_query, neon_engine)
revision

,id,date,bibleversion,published,name,backtranslation,machinetranslation
0,772,2023-02-03,505,True,None,None,False
1,138,2023-01-23,115,False,None,None,False

In [40]:
revision.rename(
    columns={
        "machinetranslation": "machine_translation",
        "backtranslation": "back_translation_id",
        "bibleversion": "bible_version_id",
    },
    inplace=True,
)
revision.drop(columns=["back_translation_id", "machine_translation"], inplace=True)
revision

    id        date  bible_version_id  published  name
0  772  2023-02-03               505       True  None
1  138  2023-01-23               115      False  None

In [41]:
revision.to_csv("../fixtures/revision_for_assessment.txt", index=False, sep="\t")

In [42]:
source_query = f'SELECT * FROM "bibleVersion" WHERE "id" in (115,505)'
version = pd.read_sql_query(source_query, neon_engine)
version

,id,name,isolanguage,isoscript,abbreviation,rights,forwardtranslation,backtranslation,machinetranslation
0,115,Ngoreme,ngq,Latn,ngq-ngqNT,None,None,None,False
1,505,Swahili Neno (reference),swh,Latn,system_swh-ONEN,,None,None,False

In [43]:
version.rename(
    columns={
        "forwardtranslation": "forward_tranlation_id",
        "isolanguage": "iso_language",
        "isoscript": "iso_script",
        "backtranslation": "back_translation_id",
        "forwardtranslation": "forward_translation_id",
        "bibleversion": "bible_version_id",
    },
    inplace=True,
)
version.drop(
    columns=[
        "forward_translation_id",
        "machinetranslation",
        "rights",
        "back_translation_id",
    ],
    inplace=True,
)

In [44]:
version

    id                      name iso_language iso_script     abbreviation
0  115                   Ngoreme          ngq       Latn        ngq-ngqNT
1  505  Swahili Neno (reference)          swh       Latn  system_swh-ONEN

In [45]:
version.to_csv("../fixtures/version_for_assessment.txt", index=False, sep="\t")

In [ ]:
## checking aqua local db

In [29]:
source_query = f'SELECT * FROM "iso_language" '
df = pd.read_sql_query(source_query, aqua_engine)
df

Empty DataFrame
Columns: [iso639, name]
Index: []